[{"charityName":"Runners for breast cancer","description":"Join us for an empowering event that combines the passion for running with the determination to fight breast cancer. Runners for Breast Cancer is a charity run dedicated to raising funds and awareness for breast cancer research, treatment, and support programs. Lace up your running shoes and be part of a united front as we sprint towards a future free from this devastating disease. Together, we can make a difference, one step at a time, and show solidarity with those affected by breast cancer, inspiring hope and resilience along the way.","goal":550,"stripeLink":"https://donate.stripe.com/test_eVa7ug0l22en6Y08ww"},{"charityName":"Feed Brevard County","description":"At Feed Brevard, our mission is clear: to make a positive impact on the lives of the homeless by addressing their most basic need—food. We firmly believe that everyone deserves access to sustenance that fuels their bodies and uplifts their souls. Through the collective efforts of compassionate volunteers, local organizations, and caring community members, we strive to create a robust network of support for those experiencing homelessness.","goal":10000,"stripeLink":"https://donate.stripe.com/test_eVa7ug0l22en6Y08ww"},{"_id":"generated-id","charityName":"Compassion Cares","description":"Compassion Cares is a charity that focuses on spreading compassion and providing care to vulnerable populations. The organization's mission is to address the physical, emotional, and social needs of individuals and communities facing challenging circumstances. By offering support services, counseling, and outreach programs, Compassion Cares aims to alleviate suffering, restore hope, and promote resilience. With a strong emphasis on empathy and understanding, the charity strives to create a more compassionate and caring society.","goal":100000,"stripeLink":"https://donate.stripe.com/test_eVa7ug0l22en6Y08ww"},{"_id":"generated-id","charityName":"abeandaustinrock","description":"At Feed Brevard, our mission is clear: to make a positive impact on the lives of the homeless by addressing their most basic need—food. We firmly believe that everyone deserves access to sustenance that fuels their bodies and uplifts their souls. Through the collective efforts of compassionate volunteers, local organizations, and caring community members, we strive to create a robust network of support for those experiencing homelessness.","goal":10000,"stripeLink":"https://donate.stripe.com/test_eVa7ug0l22en6Y08ww"}]